# ConfigurationReloadInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConfigurationReloadInfo Methods
ConfigurationReloadInfo Class See Also
---
The ConfigurationReloadInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetConnectivityValidation | Returns information about the post-reload connectivity validation. |
| GetCustomDataChangedElements | Gets a list of ElementIds of fabrication parts that had custom data updated during the reload. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetOutOfDatePartStatus | Access reload information for out of date part. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace